; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-84)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 - object)
 (:init 
    (arm-empty)
    (clear b10)
    (on b10 b2)
    (on b2 b1)
    (on b1 b21)
    (on b21 b15)
    (on b15 b19)
    (on b19 b9)
    (on b9 b4)
    (on b4 b17)
    (on b17 b5)
    (on b5 b12)
    (on b12 b18)
    (on b18 b23)
    (on b23 b24)
    (on b24 b3)
    (on b3 b8)
    (on b8 b20)
    (on-table b20)
    (clear b22)
    (on-table b22)
    (clear b6)
    (on b6 b14)
    (on b14 b13)
    (on b13 b25)
    (on b25 b16)
    (on b16 b11)
    (on b11 b7)
    (on-table b7))
 (:goal (and 
(on b25 b19)
))
)

; plan
1. (unstack b10 b2)
   deleted: (on b10 b2) (clear b10) (arm-empty)
   added: (holding b10) (clear b2)
   goals met: 0 of 1
2. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 0 of 1
3. (unstack b2 b1)
   deleted: (on b2 b1) (clear b2) (arm-empty)
   added: (holding b2) (clear b1)
   goals met: 0 of 1
4. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 0 of 1
5. (unstack b1 b21)
   deleted: (on b1 b21) (clear b1) (arm-empty)
   added: (holding b1) (clear b21)
   goals met: 0 of 1
6. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 0 of 1
7. (unstack b21 b15)
   deleted: (on b21 b15) (clear b21) (arm-empty)
   added: (holding b21) (clear b15)
   goals met: 0 of 1
8. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 0 of 1
9. (unstack b6 b14)
   deleted: (on b6 b14) (clear b6) (arm-empty)
   added: (holding b6) (clear b14)
   goals met: 0 of 1
10. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 0 of 1
11. (unstack b14 b13)
   deleted: (on b14 b13) (clear b14) (arm-empty)
   added: (holding b14) (clear b13)
   goals met: 0 of 1
12. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 0 of 1
13. (unstack b13 b25)
   deleted: (on b13 b25) (clear b13) (arm-empty)
   added: (holding b13) (clear b25)
   goals met: 0 of 1
14. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 0 of 1
15. (unstack b15 b19)
   deleted: (on b15 b19) (clear b15) (arm-empty)
   added: (holding b15) (clear b19)
   goals met: 0 of 1
16. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 0 of 1
17. (unstack b25 b16)
   deleted: (on b25 b16) (clear b25) (arm-empty)
   added: (holding b25) (clear b16)
   goals met: 0 of 1
18. (stack b25 b19)
   deleted: (clear b19) (holding b25)
   added: (arm-empty) (clear b25) (on b25 b19)
   goals met: 1 of 1
